// Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
// let a = 1;

// while (a <= 10) {
//   console.log(a);
//   a++;
// }
// Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
// for (let b = 2; b <= 20; b++) {
// if (b % 2  !== 0) {
// continue
// }
//       console.log(b);
// }


// Вивести в консоль таблицю множення числа 7 за допомогою циклу for.


// for (let c = 0; c <= 10; c++) {
//   console.log(7 * c);
// }
// console.log(c);


// Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

//   let n = 10;

//   for (let i = 0; i < 15; i++)  {
//   if (i >= n) {
//   break;
//   }
//   console.log(i);
//   }

// За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let o = 1;

while (o <= 20) {
    if (o % 3 === 0) {
        o++;
        continue;
    }
    console.log(o);
    o++;
}